/*
 * =====================================================================================
 *       Copyright (C), 2010-2020, Bridge Team
 *       Filename:  ip_cam_dev.c
 *       Compiler:  gcc
 *
 *    Description:  implement ip cam device 
 *         Others:  none
 *        History:
 *
 *        Version:  1.0
 *        Created:  05/20/10 17:07:23
 *         Author:  liukai , liukai@sunnorth.com.cn
 *        Company:  Sunplus Core Technology
 *
 *   Modification:
 *
 *
 * =====================================================================================
 */

#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <sys/ioctl.h>
#include <sys/poll.h>
#include <sys/mman.h>
#include <fcntl.h>
#include <unistd.h>


#include <unistd.h>
#include <sys/mman.h>
#include <sys/poll.h>
#include <sys/time.h>
#include <time.h>
#include <pthread.h>
#include <fcntl.h>
#include <errno.h>
#include "spct_type.h"
#include "spct6100_dev.h"
#include "ip_cam_dev.h"
#include "xml.h"

#define CAM_STATUS_RUN	0x1234
#define CAM_STATUS_INVAL 0
#define CAM_STATUS_FREE 0xabcd

#ifndef ENABLE
#define ENABLE 1
#endif

#ifndef DISABLE
#define DISABLE 0
#endif

#define PAL_WIDTH_SIZE		352
#define PAL_HEIGHT_SIZE		288
#define NTSC_WIDTH_SIZE		352
#define NTSC_HEIGHT_SIZE	240

static int fd_video1 = 0;

typedef struct query_buf_res
{
	void * start;
	int length;
} Query_Buf_Res;


#define EXIT(x)                                                         \
    do{                                                                 \
        fprintf(stderr, "%s:%d failed: %s\n", __FILE__, __LINE__, x);   \
        exit(1);                                             \
    }while(0);

struct av_packet_header{
	unsigned int header_size;      //0x0
	unsigned int packet_size;      //0x04
	unsigned int pad0;             //0x08
	unsigned int frame_type;       //0x0c
	unsigned int video_timestamp;  //0x10
	unsigned int video_length;     //0x14
	unsigned int audio_length;     //0x18
	unsigned int reserved0;        //0x1c bsps
	unsigned int video_offset;     //0x20
	unsigned int audio_offset;     //0x24
	unsigned int reserved1;        //0x28 channel id
	char videolost_enable;         //0x2c
	char motion_enable;            //0x2d
	char encode_enable;            //0x2e
	char audio_enable;             //0x2f
	unsigned int bvideolost;       //0x30
	unsigned int motion_length;    //0x34
	unsigned int audio_timestamp;  //0x38
	unsigned char pad1[88 - 0x3c]; //0x3c
} __attribute__((packed));

struct packet_header{
	unsigned int video_flag;
	unsigned int video_type;
	char * video_addr;
	unsigned int video_length;
	unsigned int video_timestamp;

	unsigned int audio_flag;
	char * audio_addr;
	unsigned int audio_length;
	unsigned int audio_timestamp;

	unsigned int motion_flag;
	char * motion_addr;
	unsigned int motion_length;

	unsigned int videolost_flag;
};

/* buffer used between ap layer and v4l2method layer*/
struct buffer_av{
    unsigned int buf_index;
    unsigned int input;
    unsigned int flags;
    unsigned int length;
    unsigned int offset;
    struct timeval timestamp;
	unsigned int bytesused;
};

int streaming_off(int fd) {
    enum v4l2_buf_type type;
    type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
    return ioctl(fd, VIDIOC_STREAMOFF, &type);
}



static int request_buffer(int fd) {
    struct v4l2_requestbuffers req;

    memset (&(req), 0, sizeof (req));
    req.count = 12;
